app/views/gossips/index.html.erb

        	<div class="card-body">
        		<a class="text-warning" href="/gossips/<%= gossip.id %>">author:<%= gossip.user.first_name %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]