app/views/gossips/show.html.erb

		<br/>
		<a class="" href="/users/<%= @goss.user.id %>">potin de : <%= @goss.user.first_name %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

        			<a class="text-warning" href=""><%= com.content %><br/></a>
        			<a class="text-warning" href=""><%= com.user.first_name %><br/></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]