app/views/static/index_potin_post.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
		<br/>
		<a class="" href="/accueil/user/<%= @goss.user.id %>">potin de : <%= @goss.user.first_name %></a>