app/views/static/index_accueil.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        		<div class="card-header border border-dark">
        	  		<a class="text-warning" href="/accueil/<%= gossip.id %>"><%= gossip.user.first_name %><br/></a>