app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1)  [["city_id", 3]]
---
  def show

    @city = City.find(params["id"])
    @gossip = Gossip.where(user_id: (@use = User.where(city_id: params["id"])))