app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
	def destroy
		puts "********************"
		puts params
    	@descom = Comment.find(params["id"])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
	def edit
    	@com = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "{\"content\"=>\"Just for once, let me look on you with my own eyes.\"}"], ["updated_at", "2019-02-07 03:02:05.214765"], ["id", 23]]
---
  	def update
  		@com = Comment.find(params[:id])
  		parasol = params["comment"]
    	if @com.update(content: parasol["content"])

SELECT COUNT(*) FROM "users"
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", ""], ["user_id", 3], ["gossip_id", 5], ["created_at", "2019-02-07 01:21:08.185493"], ["updated_at", "2019-02-07 01:21:08.185493"]]
---
	def create
		@com = Comment.new(user_id: rand(1..User.count), gossip_id: params["gossip_id"], content: params["body"])
  		if @com.save