app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["title", "gliulhk"], ["updated_at", "2019-02-06 22:52:18.579154"], ["id", 3]]
---
  def update
    @gossip = Gossip.find(params[:id])
    parasol = params["gossip"]
    if @gossip.update(title: parasol["title"], content: parasol["content"])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 2]]
---
  def destroy
    @desgoss = Gossip.find(params["id"])
    @desgoss.destroy

SELECT "gossips".* FROM "gossips"
---
  def index
    @goss = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 8]]
---
  def show
    @goss = Gossip.find(params["id"])
    @com = @goss.comments
    @nombre = @goss.comments.count

SELECT COUNT(*) FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "<fewsgd"], ["content", "etwrydhxfcgj"], ["user_id", 3], ["created_at", "2019-02-06 21:40:01.687125"], ["updated_at", "2019-02-06 21:40:01.687125"]]
---
	def create
		@gossip = Gossip.new(user_id: rand(1..User.count), title: params["title"], content: params["body"]) # avec xxx qui sont les données obtenues à partir du formulaire
  		if @gossip.save