app/controllers/gossips_controller.rb

SELECT COUNT(*) FROM "users"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "coucou"], ["content", "coucou la db"], ["user_id", 5], ["created_at", "2019-02-06 00:19:43.488872"], ["updated_at", "2019-02-06 00:19:43.488872"]]
---
	def create
		@gossip = Gossip.new(user_id: rand(1..User.count), title: params["title"], content: params["body"]) # avec xxx qui sont les données obtenues à partir du formulaire
  		if @gossip.save # essaie de sauvegarder en base @gossip