app/controllers/static_controller.rb

def index_accueil
	@goss = Gossip.all
---
SELECT "gossips".* FROM "gossips"

def index_potin_post
	@goss = Gossip.find(params["gossbo"])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def index_user_post
	@use = User.find(params["usebo"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]